olliw42/stm32ll-lib/src/stdstm32-uartd.h
//*******************************************************
// Copyright (c) OlliW, OlliW42, www.olliw.eu
// GPL3
// https://www.gnu.org/licenses/gpl-3.0.de.html
//*******************************************************
// my stripped down UART standard library
// only ISR, no DMA, no wait and tmo rx functions, no convenience functions
//*******************************************************
// Interface:
//
// #define UARTD_USE_UART1, UARTD_USE_UART2, UARTD_USE_UART3, UARTD_USE_UART3_REMAPPED, UARTD_USE_UART4, UARTD_USE_UART5
// #define UARTD_USE_LPUART1, UARTD_USE_LPUART1_REMAPPED
//
// #define UARTD_BAUD
//
// #define UARTD_USE_TX
// #define UARTD_TXBUFSIZE
// #define UARTD_USE_TX_ISR
// #define UARTD_USE_TX_DMA
//
// #define UARTD_USE_RX
// #define UARTD_RXBUFSIZE
//
// #define UARTD_IRQ_PRIORITY
//
// #define UARTD_USE_RXERRORCOUNT
//
// #define UARTD_RX_CALLBACK_FULL(c)
// #define UARTD_TC_CALLBACK() // ATTENTION: when used, one never should trigger TC isr without a byte written to the tx buffer
//
//*******************************************************
#ifndef STDSTM32_UARTD_H
#define STDSTM32_UARTD_H
#ifdef __cplusplus
extern "C" {
#endif


//-------------------------------------------------------
// Enums
//-------------------------------------------------------
// in order to not introduce hardware dependency upstream
// we define our own enums for parity and stopbits

#ifndef UART_ENUMS
#define UART_ENUMS

typedef enum {
  XUART_PARITY_NO = LL_USART_PARITY_NONE, // XUART_xxx to avoid overlap with HAL
  XUART_PARITY_EVEN = LL_USART_PARITY_EVEN,
  XUART_PARITY_ODD = LL_USART_PARITY_ODD,
  XUART_PARITY_MAKEITU32 = UINT32_MAX,
} UARTPARITYENUM;

typedef enum {
#ifdef LL_USART_STOPBITS_0_5
  UART_STOPBIT_0_5 = LL_USART_STOPBITS_0_5, // not allowed for LPUART!
#endif
  UART_STOPBIT_1 = LL_USART_STOPBITS_1,
#ifdef LL_USART_STOPBITS_1_5
  UART_STOPBIT_1_5 = LL_USART_STOPBITS_1_5, // not allowed for LPUART!
#endif
  UART_STOPBIT_2 = LL_USART_STOPBITS_2,
  UART_STOPBIT_MAKEITU32 = UINT32_MAX,
} UARTSTOPBITENUM;

#endif


//-------------------------------------------------------
// Defines
//-------------------------------------------------------

#include "stdstm32-peripherals.h"

#if (defined UARTD_USE_TX_ISR) && (!defined UARTD_USE_TX)
  #error UARTD_USE_TX_ISR used without UARTD_USE_TX!
#endif
#if (defined UARTD_USE_RXERRORCOUNT) && (!defined UARTD_USE_RX)
  #error UARTD_USE_RXERRORCOUNT used without UARTD_USE_RX!
#endif

#ifdef UARTD_USE_TX_DMA
  #error UARTD_USE_TX_DMA not supported by this library!
#endif


#ifndef UARTD_BAUD
  #define UARTD_BAUD             115200UL // 9600UL
#endif


#ifdef UARTD_USE_TX_ISR
  #ifndef UARTD_TXBUFSIZE
    #define UARTD_TXBUFSIZE      256 // MUST be 2^N
  #endif
  #if UARTD_TXBUFSIZE < 2
    #error UARTD_TXBUFSIZE must be larger than 1 !
  #elif ((UARTD_TXBUFSIZE & (UARTD_TXBUFSIZE-1)) != 0)
    #error UARTD_TXBUFSIZE must be a power of 2 !
  #endif

  #define UARTD_TXBUFSIZEMASK  (UARTD_TXBUFSIZE-1)

  volatile char uartd_txbuf[UARTD_TXBUFSIZE];
  volatile uint16_t uartd_txwritepos; // pos at which the last byte was stored
  volatile uint16_t uartd_txreadpos; // pos at which the next byte is to be fetched
#endif


#ifdef UARTD_USE_RX
  #ifndef UARTD_RXBUFSIZE
    #define UARTD_RXBUFSIZE      256 //128 //MUST be 2^N
  #endif
  #if UARTD_RXBUFSIZE < 2
    #error UARTD_RXBUFSIZE must be larger than 1 !
  #elif ((UARTD_RXBUFSIZE & (UARTD_RXBUFSIZE-1)) != 0)
    #error UARTD_RXBUFSIZE must be a power of 2 !
  #endif

  #define UARTD_RXBUFSIZEMASK  (UARTD_RXBUFSIZE-1)

  volatile char uartd_rxbuf[UARTD_RXBUFSIZE];
  volatile uint16_t uartd_rxwritepos; // pos at which the last byte was stored
  volatile uint16_t uartd_rxreadpos; // pos at which the next byte is to be fetched

  #ifdef UARTD_USE_RXERRORCOUNT
  volatile uint32_t uartd_errorcnt_rxnoise;
  volatile uint32_t uartd_errorcnt_rxframe;
  volatile uint32_t uartd_errorcnt_rxoverrun;
  #endif
#endif


#if defined UARTD_USE_UART1 || defined UARTD_USE_UART1_REMAPPED || defined UARTD_USE_UART1_REMAPPED2
  #define UARTD_UARTx             USART1
  #ifdef UARTD_USE_UART1
    #define UARTD_TX_IO           IO_PA9
    #define UARTD_RX_IO           IO_PA10
  #elif defined UARTD_USE_UART1_REMAPPED
    #define UARTD_TX_IO           IO_PB6
    #define UARTD_RX_IO           IO_PB7
  #elif defined UARTD_USE_UART1_REMAPPED2 // only G4
    #define UARTD_TX_IO           IO_PC4 // on G4
    #define UARTD_RX_IO           IO_PC5
  #endif
  #define UARTD_IO_AF             IO_AF_7
  #define UARTD_IRQn              USART1_IRQn
  #define UARTD_IRQHandler        USART1_IRQHandler
  #if defined STM32F1
  #elif defined STM32F3
  #elif defined STM32F7
  #elif defined STM32G4
  #elif defined STM32L4
  #elif defined STM32WL
  #endif

#elif defined UARTD_USE_UART2 || defined UARTD_USE_UART2_REMAPPED || defined UARTD_USE_UART2_REMAPPED2 || defined UARTD_USE_UART2_REMAPPED3
  #define UARTD_UARTx             USART2
  #ifdef UARTD_USE_UART2
    #define UARTD_TX_IO           IO_PA2
    #define UARTD_RX_IO           IO_PA3
  #elif defined UARTD_USE_UART2_REMAPPED
    #define UARTD_TX_IO           IO_PD5
    #define UARTD_RX_IO           IO_PD6
  #elif defined UARTD_USE_UART2_REMAPPED2 // only G4
    #define UARTD_TX_IO           IO_PB3
    #define UARTD_RX_IO           IO_PB4
  #elif defined UARTD_USE_UART2_REMAPPED3 // only G4 // ATTENTION: PA14 overlaps with SWCLK
    #define UARTD_TX_IO           IO_PA14
    #define UARTD_RX_IO           IO_PA15
  #endif
  #define UARTD_IO_AF             IO_AF_7
  #define UARTD_IRQn              USART2_IRQn
  #define UARTD_IRQHandler        USART2_IRQHandler
  #if defined STM32F1
  #elif defined STM32F3
  #elif defined STM32F7
  #elif defined STM32G4
  #elif defined STM32L4
  #elif defined STM32WL
  #endif

#elif defined UARTD_USE_UART3 || defined UARTD_USE_UART3_REMAPPED
  #define UARTD_UARTx             USART3
  #if defined UARTD_USE_UART3 && defined STM32F3
    #define UARTD_TX_IO           IO_PB8
    #define UARTD_RX_IO           IO_PB9
  #elif defined UARTD_USE_UART3
    #define UARTD_TX_IO           IO_PB10
    #define UARTD_RX_IO           IO_PB11
  #else
    #define UARTD_TX_IO           IO_PC10
    #define UARTD_RX_IO           IO_PC11
  #endif
  #define UARTD_IO_AF             IO_AF_7
  #define UARTD_IRQn              USART3_IRQn
  #define UARTD_IRQHandler        USART3_IRQHandler
  #if defined STM32F1
  #elif defined STM32F3
  #elif defined STM32F7
  #elif defined STM32G4
  #elif defined STM32L4
  #elif defined STM32WL
    #error UART3 NOT AVAILABLE !
  #endif

